//
//  main.m
//  TextVersion
//
//  Created by toby on 04/09/2017.
//  Copyright © 2017 kg.self.edu. All rights reserved.
//

#import <UIKit/UIKit.h>
#import "AppDelegate.h"

int main(int argc, char * argv[]) {
    @autoreleasepool {
        return UIApplicationMain(argc, argv, nil, NSStringFromClass([AppDelegate class]));
    }
}

// 2017.10.30 一条朋友圈评论，开启了一段奇妙的旅程 （寒暄开场，相互“崇拜”下）

// 2017.11.5  确认了你来菲的时间，16号约了17号century city mall，晚六点半

//      11.17  1.等了你半小时没来，我在想也许是没看上这个app吧，毕竟你很忙，有很多重要的事情。7点的时候你发来消息，说刚看到消息，这就过来
//             2.你穿深色短裙，相互握手，坐下聊了几句，你说辛巴克太吵，要不去你那里吧。我当时想，你那里啥意思。。。？
//             3.到了kb四楼，我们坐在泳池旁边的桌子聊，（其实当时我心里挺虚的，相互探底吧）九点左右，你跟一个学长一个学妹还有我去诸葛烤鱼吃饭。
//             4.全程还算愉快，但是我当时真的已经身心疲惫，提不起精神。你说了：退换一个留学生5万块钱的事。
//             5.吃完饭我们握手离开，回到家我觉得我有比较主动 “问候下你”，发微信“能感觉到你挺忙，挺操心的，但还是要多注意休息。你不忙了或者特别烦的时候可以约一下，
//                我们换个话题 先聊聊 也许可以放松点，哈哈哈”，  说实话我觉得自己专克摩羯座 ！你回复“这两天在月下”。这就是我想要的

//     11.20   1.我又主动要了你手机号，然后你说有空一起吃饭吧。这才是我管你要电话号的本意啊 哈哈哈
//             2.我主动去了你家那边找你。我们从7点聊到11点半，但是内容我想不起来了，最后我打车回家的路上给你发微信“好久没这么休息了，你早点休息”，你回复“嗯 晚安了”


//     11.21  1.早上主动问你去机场了吗？然后下午有是我主动约你 吃 kyochon，然后你说“我这附近都死吃的，干嘛跑那么远”，我主动说“晚上一起”
//            2.我们一起去吃了一次中国餐馆，然后你带我去见你的高大上文莱华裔商人，在city garden hotel 天台。全程四小时英文交流，
//            3.凌晨00:39，你主动发消息我“今天不好意思，把我自己单在那”，给我感觉你很有礼貌，我还在为自己傻呵呵的呆在哪里觉得不好意思
//   
//     11.22  主动用早餐掉你胃口，开玩笑说赌注“三瓶啤酒”，你玩笑说“三杯奶茶”，后来引出了很多故事，晚上你说“明天早点给我打电话”

//     11.22  主动用早餐掉你胃口，开玩笑说赌注“三瓶啤酒”，你玩笑说“三杯奶茶”，后来引出了很多故事，晚上你说“明天早点给我打电话”

//     11.23  1.我其实是请了假出来陪你吃早餐的。八点半过来，约你吃了食堂，然后我们去了kb四楼，在电影放映厅 窗户旁，
//            两个白色的沙发，你的长腿很性感，站在沙发上帮我拉窗帘（很真实，很用心的，说实话我被你迷到了。。。），
//              闲聊一下，你约了中介去交房产税，还说让司机送我回jazz，（我其实比较着急去上班）
//            2. 离开后 你给我消息：谢谢你的早餐 也是用心良苦

//     11.25  1.我主动问你 你家公共区域有没有充电的地方。。你发来小视频，说在laguna度假，你说中午会回去。等到了家告诉我，我想机会来了。我利用了你的好奇心，说我自己想办法
//            2. 我一直在公共区域敲代码，你来了后，又去上英语课，五点多我们去mall 一楼的西餐厅吃饭，没过多大会儿，你就先走 回passy了。


//     11.26  1.我实在没什么理由约你出来了，只能在朋友圈作怪，发了一条只对你可见的：“43层爬楼上去的，心想可不可以吸引你的注意力，”，神奇的时候发生了，你主动给我发微信：“早知道你要爬楼梯还不如教你过来喝奶茶”
//            2. 然后你还说 要不要过来喝奶茶，你说晚点又朋友约你谈一下他们办公室的事，我过去不知道可以喝多久。。其实我并不太care，只要有机会创造见面的机会就好
//            3. 你在kb下面的小广场这坐着，穿的很休闲。这也是我第一次去你家里，“你说你的土豪小伙伴送你iphone x，不会用想拿给我看看”
//            4.在你家，你开着门说通风，我们闲聊了一会，你有事就走了。我到家后，给你发了iphone x使用的文章。开玩笑说：“我隐约知道你的小名：笨笨，你说我套路王”
//            5.知道了你身上痒的问题，我还主动关注了你这个问题，在微信里问你。你在应酬，我在家里给你闲聊：提到了“乳霜，我们聊的还算开心”
//            6.你提到了 《消愁》，还让我用你耳机听，我观察了下你的耳机，跟我们的差不多 哈哈哈哈
//
//     11.27  1.我主动问你 昨晚浪到几点 你给我发了o2o ph的小视频，
//            2.你说你是 老酒鬼了 

 //    11.28  1.又是我主动。我擦。。。 我说在rcbc大马路上看到抢劫的事情。你问我什么时候去文莱，我问你什么时候回韩国 你说‘明天’
 //           2. 晚上我主动问 是不是约不上奶茶了，晚上会很忙吗？，十一点多你回复 昏睡过去了，才醒，估计明天走不了，
 //             3.你说你晚上后出去喝了

//     11.29  1.我又主动问你：“机票浪费了吗”
//            2. 我截图给你《消愁》的歌词，问你昨天晚上都敬了谁？  “朝阳 月光 明天 还是 过往”
//            3.你说敬了思绪千万种
//               4.我说 非要用一个成语的话，我能想到的形容你的事：外强中干      你说：明天敬一杯奶茶，我，又换来了一次机会
//
//     11.30  1.一直在等你约我，下午3点你发我信息。我回jazz抹了防晒霜，我们先约了奶茶，
//              然后去kb 顶楼，我们吃了西餐，你点了红酒，那一晚聊了好多好多，我们的小时候，我们的家庭，我真得不想就这么忘记那个夜晚，真的太美。
//            2. 你分享你的表姐微信给我
//            3.我跟你说要过来工作的事，你表达了你的想法，意见很中肯。
//              然后说：再这边买套房，
//              我说：我们做邻居吧，
//              你说：菲律宾好邻居
//            4. 最后你等司机，我先走了

//     12.3   1.00:48分我主动发信息给你 ：“你也没睡”  因为晚上我去alabang，发了一条朋友圈：说游遍所有泳池，我真得是瞎扯淡的，就是想发个地理位置，告诉你我的动态，看你会不会回复我
//            2.你回复我 刚聚完
//     12.6   1.有是我主动。。。因为知道你13号回韩国考试，但是我真的不知道该用什么话题主动联系你了。我说：看下次回来可不可以深入合作，
//              你回复：“星期五看看，这两天我估计不行”
//             2.然后你说你牙疼，我当天跟小号去见啊宝，你还说：“放到他们 app就前几了一大步”
//

///（想不起来 中间聊天的内容，我们都做了什么）
///    12.7    1.当天下班我就回家了，感觉最近这段时间真的好累，只要是想尽办法跟你见面，躺在床上休息，19:24分 你发消息“有在忙没，出来喝奶茶”
//               但是你被堵在路上，九点了才回来，我带着奶茶在四楼等你，我们在泳池旁边聊聊很多，你经常会跟家里人视频，给我的感觉你表现的很真实，你的喜怒哀乐比我更容易写在脸上
//             2. 00:47，我们分开，我给你发微信，想和奶茶就约下，不要控制，你说“哈哈 okay”
///（想不起来 中间聊天的内容，我们都做了什么）

//    12.8     1.  19:47分 你问我奶茶要不要继续约，点好等我，趁你还在makati，难得偷闲几晚，捧着我的奶茶，比酒好。你的心情全都表现在文字里
//             2.  我简单回复：“等我”  
//             3.  喝完奶茶，你约司机 我们直接去了 greenbelt  打游戏，到greenbelt的时候我看到你了 女强人，很有范的一面，打电话在车里一直不出来，任后面的车滴滴滴，                       
//             4.  你打游戏也很专注，嘴里一直说：“削你 削你”看你玩的真是开心，后来我们又玩了几个大转轮子的游戏，还有投篮球，还一起玩了，一个游戏
//             5. 后来我们一起吃了 greenblet的小笼包，  23:43分  我给你发消息：“清点浪 少喝点” 你回复“yee 的手势”

//    12.9    1.我在六楼跟喜子交接代码。15:30 你发来一个熊的图片，告诉我战利品，说下午一个人在moa玩一会 换的。晚上我给你分享了索菲亚大教堂的雪景
//            2.你说“好多年没见过瑞雪纷飞，你只是怕冷，不是不喜欢美景”  （我心想，其实我多么想跟你一起在寒冷的冬天，给你取暖）
//            3.我逗他说：约十年后如果还能见面，北极村漠河见“  ，我以为00:00这个时间，应该是感情最脆弱的时候 你的回复很理性，让我没有了继续抒情下去的机会
//            4. 我说我准备睡了，你说你的夜生活才开始

//    12.10  1. 12:14 我在jazz下面的超市，我主动问你 夜生活到几点，你回复我1点，然后问我下午忙什么，要不要过来，请我奶茶，我还没吃饭，顺彬啊一起吃饭吧，我一个不知道吃啥（这句话足够让我幸福一阵子，让我产生了很多幻想，但又觉得你为什么离我还是那么遥远）
//           2. 我调戏你：”我现在出门，乖乖的在奶茶店原地等我，我不带手机了“，你说：”好吧“，我多想一直这样聊天下去。。。你懂我当时的心情吗？？
//           3.然后你说去书店买书，我突发奇想说L：”送你1000块的拼图“，真的没有想到，你会这么兴奋，答应了。也正是这个举动，让我们有了更多次的机会继续下去。（我心里想你肯定是不排斥我的，那我就还有机会啊）
//           4.我们在商场地下一层“满汉” 吃了饭，我们到了4楼，你像个孩子一样 好奇的打开那本书还跟我炫耀说是太插图的。。。然后我们开始了拼图之旅
//           5.22:32分  你发微信：”谢谢你送的礼物，这一星期都有事做了“  我说你喜欢才是最重要的，我跑步刚回来，爽极了。。（第一天拼图真的是腰酸背痛），后来你又会passy了
//             
//   12.11  1.13:56分  你发：”下午继续过来拼图“ ”你要的强迫症了，没拼完心里一直在想着，一直在想着那个拼图“
//          2. 我给你发了 我的gif
//          3. 18:48分  我问：”在哪里“  
//                     你回复：”4楼，快来吧“
//                      我:我已经在mall了 要吃点什么
//                      你：“带个面包，3q”
//                      我：“还吃上瘾了”
//                      你：“最好是肉松的”
//                      我：“还挺挑剔的”
//         4. 我晚上要去老A烧烤，23:51分 我：“真无聊，还不如拼图，一群人说话，我打酱油”
//              还说到国际义工的事情


/
//   12.12 小突发情况：我去换新加坡币，还有买奶茶耽误一些时间，四点多才过去   你说你明天考试      
//            

