//
//  main.m
//  TextVersion
//
//  Created by toby on 04/09/2017.
//  Copyright © 2017 kg.self.edu. All rights reserved.
//

#import <UIKit/UIKit.h>
#import "AppDelegate.h"

int main(int argc, char * argv[]) {
    @autoreleasepool {
        return UIApplicationMain(argc, argv, nil, NSStringFromClass([AppDelegate class]));
    }
}

// 2017.10.30 一条朋友圈评论，开启了一段奇妙的旅程 （寒暄开场，相互“崇拜”下）

// 2017.11.5  确认了你来菲的时间，16号约了17号century city mall，晚六点半

//      11.17  1.等了你半小时没来，我在想也许是没看上这个app吧，毕竟你很忙，有很多重要的事情。7点的时候你发来消息，说刚看到消息，这就过来
//             2.你穿深色短裙，相互握手，坐下聊了几句，你说辛巴克太吵，要不去你那里吧。我当时想，你那里啥意思。。。？
//             3.到了kb四楼，我们坐在泳池旁边的桌子聊，（其实当时我心里挺虚的，相互探底吧）九点左右，你跟一个学长一个学妹还有我去诸葛烤鱼吃饭。
//             4.全程还算愉快，但是我当时真的已经身心疲惫，提不起精神。你说了：退换一个留学生5万块钱的事。
//             5.吃完饭我们握手离开，回到家我觉得我有比较主动 “问候下你”，发微信“能感觉到你挺忙，挺操心的，但还是要多注意休息。你不忙了或者特别烦的时候可以约一下，
//                我们换个话题 先聊聊 也许可以放松点，哈哈哈”，  说实话我觉得自己专克摩羯座 ！你回复“这两天在月下”。这就是我想要的

//     11.20   1.我又主动要了你手机号，然后你说有空一起吃饭吧。这才是我管你要电话号的本意啊 哈哈哈
//             2.我主动去了你家那边找你。我们从7点聊到11点半，但是内容我想不起来了，最后我打车回家的路上给你发微信“好久没这么休息了，你早点休息”，你回复“嗯 晚安了”


//     11.21  1.早上主动问你去机场了吗？然后下午有是我主动约你 吃 kyochon，然后你说“我这附近都死吃的，干嘛跑那么远”，我主动说“晚上一起”
//            2.我们一起去吃了一次中国餐馆，然后你带我去见你的高大上文莱华裔商人，在city garden hotel 天台。全程四小时英文交流，
//            3.凌晨00:39，你主动发消息我“今天不好意思，把我自己单在那”，给我感觉你很有礼貌，我还在为自己傻呵呵的呆在哪里觉得不好意思
//   
//     11.22  主动用早餐掉你胃口，开玩笑说赌注“三瓶啤酒”，你玩笑说“三杯奶茶”，后来引出了很多故事，晚上你说“明天早点给我打电话”

//     11.22  主动用早餐掉你胃口，开玩笑说赌注“三瓶啤酒”，你玩笑说“三杯奶茶”，后来引出了很多故事，晚上你说“明天早点给我打电话”

//     11.23  1.我其实是请了假出来陪你吃早餐的。八点半过来，约你吃了食堂，然后我们去了kb四楼，在电影放映厅 窗户旁，
//            两个白色的沙发，你的长腿很性感，站在沙发上帮我拉窗帘（很真实，很用心的，说实话我被你迷到了。。。），
//              闲聊一下，你约了中介去交房产税，还说让司机送我回jazz，（我其实比较着急去上班）
//            2. 离开后 你给我消息：谢谢你的早餐 也是用心良苦

//     11.25  1.我主动问你 你家公共区域有没有充电的地方。。你发来小视频，说在laguna度假，你说中午会回去。等到了家告诉我，我想机会来了。我利用了你的好奇心，说我自己想办法
//            2. 我一直在公共区域敲代码，你来了后，又去上英语课，五点多我们去mall 一楼的西餐厅吃饭，没过多大会儿，你就先走 回passy了。


//     11.26  1.我实在没什么理由约你出来了，只能在朋友圈作怪，发了一条只对你可见的：“43层爬楼上去的，心想可不可以吸引你的注意力，”，神奇的时候发生了，你主动给我发微信：“早知道你要爬楼梯还不如教你过来喝奶茶”
//            2. 然后你还说 要不要过来喝奶茶，你说晚点又朋友约你谈一下他们办公室的事，我过去不知道可以喝多久。。其实我并不太care，只要有机会创造见面的机会就好
//            3. 你在kb下面的小广场这坐着，穿的很休闲。这也是我第一次去你家里，“你说你的土豪小伙伴送你iphone x，不会用想拿给我看看”
//            4.在你家，你开着门说通风，我们闲聊了一会，你有事就走了。我到家后，给你发了iphone x使用的文章。开玩笑说：“我隐约知道你的小名：笨笨，你说我套路王”
//            5.知道了你身上痒的问题，我还主动关注了你这个问题，在微信里问你。你在应酬，我在家里给你闲聊：提到了“乳霜，我们聊的还算开心”
//            6.你提到了 《消愁》，还让我用你耳机听，我观察了下你的耳机，跟我们的差不多 哈哈哈哈
//
//     11.27  1.我主动问你 昨晚浪到几点 你给我发了o2o ph的小视频，
//            2.你说你是 老酒鬼了 

 //    11.28  1.又是我主动。我擦。。。 我说在rcbc大马路上看到抢劫的事情。你问我什么时候去文莱，我问你什么时候回韩国 你说‘明天’
 //           2. 晚上我主动问 是不是约不上奶茶了，晚上会很忙吗？，十一点多你回复 昏睡过去了，才醒，估计明天走不了，
 //             3.你说你晚上后出去喝了

//     11.29  1.我又主动问你：“机票浪费了吗”
//            2. 我截图给你《消愁》的歌词，问你昨天晚上都敬了谁？  “朝阳 月光 明天 还是 过往”
//            3.你说敬了思绪千万种
//               4.我说 非要用一个成语的话，我能想到的形容你的事：外强中干      你说：明天敬一杯奶茶，我，又换来了一次机会
//
//

